{
  "name": "df",
  "shortDescription": "report file system disk space usage",
  "longDescription": "This  manual page documents the GNU version of df.  df displays the amount of disk space available on the file system containing each file name argument.  If no file name is given, the space  available  on  all  currently mounted  file  systems is shown.  Disk space is shown in 1K blocks by default, unless the environment variable POSIXLY_CORRECT is set, in which case 512-byte blocks are used.",
  "syntaxes": [
    "df [OPTION]... [FILE]..."
  ],
  "options": [
    {
      "name": "k",
      "argumentType": "NO_ARGUMENT",
      "description": "Print sizes in 1024-byte blocks, overriding the default block size (*note Block size::).  This option is equivalent to ‘--block-size\u003d1K’.",
      "isLong": false
    },
    {
      "name": "v",
      "argumentType": "NO_ARGUMENT",
      "description": "Ignored; for compatibility with System V versions of ‘df’.",
      "isLong": false
    },
    {
      "name": "all",
      "argumentType": "NO_ARGUMENT",
      "equivalent": "a",
      "description": "Include in the listing dummy, duplicate, or inaccessible file systems, which are omitted by default.  Dummy file systems are typically special purpose pseudo file systems such as ‘/proc’, with no associated storage.  Duplicate file systems are local or remote file systems that are mounted at separate locations in the local file hierarchy, or bind mounted locations.  Inaccessible file systems are those which are mounted but subsequently over-mounted by another file system at that point, or otherwise inaccessible due to permissions of the mount point etc.",
      "isLong": true
    },
    {
      "name": "block-size",
      "argumentType": "ARGUMENT_REQUIRED",
      "equivalent": "B",
      "description": "Scale sizes by SIZE before printing them (*note Block size::).  For example, ‘-BG’ prints sizes in units of 1,073,741,824 bytes.",
      "isLong": true
    },
    {
      "name": "inodes",
      "argumentType": "NO_ARGUMENT",
      "equivalent": "i",
      "description": "List inode usage information instead of block usage.  An inode (short for index node) contains information about a file such as its owner, permissions, timestamps, and location on the disk.",
      "isLong": true
    },
    {
      "name": "human-readable",
      "argumentType": "NO_ARGUMENT",
      "equivalent": "h",
      "description": "Append a size letter to each size, such as ‘M’ for mebibytes. Powers of 1024 are used, not 1000; ‘M’ stands for 1,048,576 bytes. This option is equivalent to ‘--block-size\u003dhuman-readable’.  Use the ‘--si’ option if you prefer powers of 1000.",
      "isLong": true
    },
    {
      "name": "si",
      "argumentType": "NO_ARGUMENT",
      "equivalent": "H",
      "description": "Append an SI-style abbreviation to each size, such as ‘M’ for megabytes.  Powers of 1000 are used, not 1024; ‘M’ stands for 1,000,000 bytes.  This option is equivalent to ‘--block-size\u003dsi’. Use the ‘-h’ or ‘--human-readable’ option if you prefer powers of 1024.",
      "isLong": true
    },
    {
      "name": "local",
      "argumentType": "NO_ARGUMENT",
      "equivalent": "l",
      "description": "Limit the listing to local file systems.  By default, remote file systems are also listed.",
      "isLong": true
    },
    {
      "name": "output",
      "argumentType": "OPTIONAL_ARGUMENT",
      "description": "Use the output format defined by FIELD_LIST, or print all fields if FIELD_LIST is omitted.  In the latter case, the order of the columns conforms to the order of the field descriptions below.",
      "isLong": true
    },
    {
      "name": "portability",
      "argumentType": "NO_ARGUMENT",
      "equivalent": "P",
      "description": "Use the POSIX output format.  This is like the default format except for the following:",
      "isLong": true
    },
    {
      "name": "print-type",
      "argumentType": "NO_ARGUMENT",
      "equivalent": "T",
      "description": "Print each file system’s type.  The types printed here are the same ones you can include or exclude with ‘-t’ and ‘-x’.  The particular types printed are whatever is supported by the system.  Here are some of the common names (this list is certainly not exhaustive):",
      "isLong": true
    },
    {
      "name": "sync",
      "argumentType": "NO_ARGUMENT",
      "description": "Invoke the ‘sync’ system call before getting any usage data.  On some systems (notably SunOS), doing this yields more up to date results, but in general this option makes ‘df’ much slower, especially when there are many or very busy file systems.",
      "isLong": true
    },
    {
      "name": "no-sync",
      "argumentType": "NO_ARGUMENT",
      "description": "Do not invoke the ‘sync’ system call before getting any usage data. This may make ‘df’ run significantly faster on systems with many disks, but on some systems (notably SunOS) the results may be slightly out of date.  This is the default.",
      "isLong": true
    },
    {
      "name": "total",
      "argumentType": "NO_ARGUMENT",
      "description": "Print a grand total of all arguments after all arguments have been processed.  This can be used to find out the total disk size, usage and available space of all listed devices.  If no arguments are specified df will try harder to elide file systems insignificant to the total available space, by suppressing duplicate remote file systems.",
      "isLong": true
    },
    {
      "name": "type",
      "argumentType": "ARGUMENT_REQUIRED",
      "equivalent": "t",
      "description": "Limit the listing to file systems of type FSTYPE.  Multiple file system types can be specified by giving multiple ‘-t’ options.  By default, nothing is omitted.",
      "isLong": true
    },
    {
      "name": "exclude-type",
      "argumentType": "ARGUMENT_REQUIRED",
      "equivalent": "x",
      "description": "Limit the listing to file systems not of type FSTYPE.  Multiple file system types can be eliminated by giving multiple ‘-x’ options.  By default, no file system types are omitted.",
      "isLong": true
    },
    {
      "name": "help",
      "argumentType": "NO_ARGUMENT",
      "isLong": true
    },
    {
      "name": "version",
      "argumentType": "NO_ARGUMENT",
      "isLong": true
    }
  ]
}
